In [2]:
import pandas as pd

1. 데이터 리드
2. null값 제거
3. 피처와 레이블(서바이브드) 분리
4. 문자열 인코딩, 스케일링

In [21]:
df = pd.read_csv("C:/PYTHON/G_ML/csv/train.csv")

In [22]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df.drop(["PassengerId", "Name", "SibSp", "Parch", "Ticket", "Fare", "Cabin"], axis=1, inplace=True)

In [24]:
df.head()

   Survived  Pclass     Sex   Age Embarked
0         0       3    male  22.0        S
1         1       1  female  38.0        C
2         1       3  female  26.0        S
3         1       1  female  35.0        S
4         0       3    male  35.0        S

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Embarked  889 non-null    object
dtypes: float64(1), int64(2), object(2)
memory usage: 34.9+ KB

In [26]:
df.dropna(axis=0)

     Survived  Pclass     Sex   Age Embarked
0           0       3    male  22.0        S
1           1       1  female  38.0        C
2           1       3  female  26.0        S
3           1       1  female  35.0        S
4           0       3    male  35.0        S
..        ...     ...     ...   ...      ...
885         0       3  female  39.0        Q
886         0       2    male  27.0        S
887         1       1  female  19.0        S
889         1       1    male  26.0        C
890         0       3    male  32.0        Q

[712 rows x 5 columns]

In [27]:
## Sex, Embarked encoding
from sklearn.preprocessing import LabelEncoder

In [28]:
encoder = LabelEncoder()
df['Sex'] = data = encoder.fit_transform(df['Sex'])

In [29]:
df.head()

   Survived  Pclass  Sex   Age Embarked
0         0       3    1  22.0        S
1         1       1    0  38.0        C
2         1       3    0  26.0        S
3         1       1    0  35.0        S
4         0       3    1  35.0        S

In [30]:
df['Embarked'] = data = encoder.fit_transform(df['Embarked'])

In [31]:
df.head()

   Survived  Pclass  Sex   Age  Embarked
0         0       3    1  22.0         2
1         1       1    0  38.0         0
2         1       3    0  26.0         2
3         1       1    0  35.0         2
4         0       3    1  35.0         2

In [32]:
data = df.loc[:,'Embarked']

In [33]:
data

0      2
1      0
2      2
3      2
4      2
      ..
886    2
887    2
888    2
889    0
890    1
Name: Embarked, Length: 891, dtype: int32

In [19]:
dummy_embarke = pd.get_dummies(data)
dummy_embarke

## 이거 할 필요없이 뒤에꺼가 더 나음 이름 잘 나와있으니까

     0  1  2  3
0    0  0  1  0
1    1  0  0  0
2    0  0  1  0
3    0  0  1  0
4    0  0  1  0
..  .. .. .. ..
886  0  0  1  0
887  0  0  1  0
888  0  0  1  0
889  1  0  0  0
890  0  1  0  0

[891 rows x 4 columns]

In [20]:
dummy_data = pd.get_dummies(df[['Sex', 'Embarked']])
dummy_data

     Sex  Embarked
0      1         2
1      0         0
2      0         2
3      0         2
4      1         2
..   ...       ...
886    1         2
887    0         2
888    0         2
889    1         0
890    1         1

[891 rows x 2 columns]